bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J18A.atdf
        <register name="SEQCTRL" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="Sequence Control">
          <bitfield name="SEQEN" caption="Enable Positive Input in the Sequence" mask="0xFFFFFFFF"/>
        </register>
        <register name="CALIB" offset="0x2C" rw="RW" size="2" initval="0x0000" caption="Calibration">
          <bitfield name="BIASCOMP" caption="Bias Comparator Scaling" mask="0x7"/>
          <bitfield name="BIASREFBUF" caption="Bias Reference Buffer Scaling" mask="0x700"/>
        </register>
      </register-group>
      <value-group name="ADC_CTRLB__PRESCALER">
        <value name="DIV2" caption="Peripheral clock / 2" value="0x0"/>
        <value name="DIV4" caption="Peripheral clock / 4" value="0x1"/>
        <value name="DIV8" caption="Peripheral clock / 8" value="0x2"/>
        <value name="DIV16" caption="Peripheral clock / 16" value="0x3"/>
        <value name="DIV32" caption="Peripheral clock / 32" value="0x4"/>
        <value name="DIV64" caption="Peripheral clock / 64" value="0x5"/>
        <value name="DIV128" caption="Peripheral clock / 128" value="0x6"/>
        <value name="DIV256" caption="Peripheral clock / 256" value="0x7"/>
      </value-group>
      <value-group name="ADC_REFCTRL__REFSEL">
        <value name="INTREF" caption="Internal Bandgap Reference" value="0x0"/>
        <value name="INTVCC0" caption="1/1.6 VDDANA" value="0x1"/>
        <value name="INTVCC1" caption="1/2 VDDANA" value="0x2"/>
        <value name="AREFA" caption="External Reference" value="0x3"/>
        <value name="DAC" caption="DAC" value="0x4"/>
        <value name="INTVCC2" caption="VDDANA" value="0x5"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXNEG">
        <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
        <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
        <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
        <value name="GND" caption="Internal Ground" value="0x18"/>
      </value-group>
      <value-group name="ADC_INPUTCTRL__MUXPOS">
        <value name="AIN0" caption="ADC AIN0 Pin" value="0x0"/>
        <value name="AIN1" caption="ADC AIN1 Pin" value="0x1"/>
        <value name="AIN2" caption="ADC AIN2 Pin" value="0x2"/>
        <value name="AIN3" caption="ADC AIN3 Pin" value="0x3"/>
        <value name="AIN4" caption="ADC AIN4 Pin" value="0x4"/>
        <value name="AIN5" caption="ADC AIN5 Pin" value="0x5"/>
        <value name="AIN6" caption="ADC AIN6 Pin" value="0x6"/>
        <value name="AIN7" caption="ADC AIN7 Pin" value="0x7"/>
        <value name="AIN8" caption="ADC AIN8 Pin" value="0x8"/>
        <value name="AIN9" caption="ADC AIN9 Pin" value="0x9"/>
        <value name="AIN10" caption="ADC AIN10 Pin" value="0xA"/>
        <value name="AIN11" caption="ADC AIN11 Pin" value="0xB"/>
        <value name="BANDGAP" caption="Bandgap Voltage" value="0x19"/>
        <value name="SCALEDCOREVCC" caption="1/4 Scaled Core Supply" value="0x1A"/>
        <value name="SCALEDIOVCC" caption="1/4 Scaled I/O Supply" value="0x1B"/>
        <value name="DAC" caption="DAC Output" value="0x1C"/>
      </value-group>
      <value-group name="ADC_CTRLC__DUALSEL">
        <value name="BOTH" caption="Start event or software trigger will start a conversion on both ADCs" value="0"/>
        <value name="INTERLEAVE" caption="START event or software trigger will alternately start a conversion on ADC0 and ADC1" value="1"/>
      </value-group>
      <value-group name="ADC_CTRLC__RESSEL">
        <value name="12BIT" caption="12-bit" value="0x0"/>
        <value name="16BIT" caption="16-bit averaging mode" value="0x1"/>
        <value name="10BIT" caption="10-bit" value="0x2"/>
        <value name="8BIT" caption="8-bit" value="0x3"/>
      </value-group>
      <value-group name="ADC_CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0"/>
        <value name="MODE1" caption="RESULT &gt; WINLT" value="1"/>
        <value name="MODE2" caption="RESULT &lt; WINUT" value="2"/>
        <value name="MODE3" caption="WINLT &lt; RESULT &lt; WINUT" value="3"/>
        <value name="MODE4" caption="!(WINLT &lt; RESULT &lt; WINUT)" value="4"/>
      </value-group>
      <value-group name="ADC_AVGCTRL__SAMPLENUM">
        <value name="1" caption="1 sample" value="0x0"/>
        <value name="2" caption="2 samples" value="0x1"/>
        <value name="4" caption="4 samples" value="0x2"/>
        <value name="8" caption="8 samples" value="0x3"/>
        <value name="16" caption="16 samples" value="0x4"/>
        <value name="32" caption="32 samples" value="0x5"/>
        <value name="64" caption="64 samples" value="0x6"/>
        <value name="128" caption="128 samples" value="0x7"/>
        <value name="256" caption="256 samples" value="0x8"/>
        <value name="512" caption="512 samples" value="0x9"/>
        <value name="1024" caption="1024 samples" value="0xA"/>
      </value-group>
    </module>
    <module name="CAN" id="U2003" version="2.0.0" caption="Control Area Network">
      <register-group name="CAN" caption="Control Area Network">
        <register name="CREL" offset="0x0" rw="R" size="4" initval="0x32100000" caption="Core Release">
          <bitfield name="SUBSTEP" caption="Sub-step of Core Release" mask="0xF00000"/>
          <bitfield name="STEP" caption="Step of Core Release" mask="0xF000000"/>
          <bitfield name="REL" caption="Core Release" mask="0xF0000000"/>
        </register>
        <register name="ENDN" offset="0x4" rw="R" size="4" initval="0x87654321" caption="Endian">
          <bitfield name="ETV" caption="Endianness Test Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="MRCFG" offset="0x8" rw="RW" size="4" initval="0x00000002" caption="Message RAM Configuration">
          <bitfield name="QOS" caption="Quality of Service" mask="0x3" values="CAN_MRCFG__QOS"/>
        </register>
        <register name="DBTP" offset="0xC" rw="RW" size="4" initval="0x00000A33" caption="Fast Bit Timing and Prescaler">
          <bitfield name="DSJW" caption="Data (Re)Synchronization Jump Width" mask="0xF"/>
          <bitfield name="DTSEG2" caption="Data time segment after sample point" mask="0xF0"/>
          <bitfield name="DTSEG1" caption="Data time segment before sample point" mask="0x1F00"/>
          <bitfield name="DBRP" caption="Data Baud Rate Prescaler" mask="0x1F0000"/>
          <bitfield name="TDC" caption="Tranceiver Delay Compensation" mask="0x800000"/>
        </register>
        <register name="TEST" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Test">
          <bitfield name="LBCK" caption="Loop Back Mode" mask="0x10"/>
          <bitfield name="TX" caption="Control of Transmit Pin" mask="0x60" values="CAN_TEST__TX"/>
          <bitfield name="RX" caption="Receive Pin" mask="0x80"/>
        </register>
        <register name="RWD" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="RAM Watchdog">
          <bitfield name="WDC" caption="Watchdog Configuration" mask="0xFF"/>
          <bitfield name="WDV" caption="Watchdog Value" mask="0xFF00"/>
        </register>
        <register name="CCCR" offset="0x18" rw="RW" access="WSYNC" size="4" initval="0x00000001" caption="CC Control">
          <bitfield name="INIT" caption="Initialization" mask="0x1"/>
          <bitfield name="CCE" caption="Configuration Change Enable" mask="0x2"/>
          <bitfield name="ASM" caption="ASM Restricted Operation Mode" mask="0x4"/>
          <bitfield name="CSA" caption="Clock Stop Acknowledge" mask="0x8"/>
          <bitfield name="CSR" caption="Clock Stop Request" mask="0x10"/>
          <bitfield name="MON" caption="Bus Monitoring Mode" mask="0x20"/>
          <bitfield name="DAR" caption="Disable Automatic Retransmission" mask="0x40"/>
          <bitfield name="TEST" caption="Test Mode Enable" mask="0x80"/>
          <bitfield name="FDOE" caption="FD Operation Enable" mask="0x100"/>
          <bitfield name="BRSE" caption="Bit Rate Switch Enable" mask="0x200"/>
          <bitfield name="PXHD" caption="Protocol Exception Handling Disable" mask="0x1000"/>
          <bitfield name="EFBI" caption="Edge Filtering during Bus Integration" mask="0x2000"/>
          <bitfield name="TXP" caption="Transmit Pause" mask="0x4000"/>
          <bitfield name="NISO" caption="Non ISO Operation" mask="0x8000"/>
        </register>
